module.exports.config = {
    name: "autotime",
  version: "1.0.0",
  permission: 0,
  credits: "Nayan",
  description: "msg",
  prefix: true, 
  category: "user", 
  usages: "",
  cooldowns: 5,
  dependencies: {
	}
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['~ এখন রাত ১১টা বাজে\nখাউয়া দাউয়া করে নেউ সবাই!!🍱😙  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
             {
    timer: '1:00:00 AM',
    message: ['~ এখন রাত ১২টা বেজে গেলো সবাই শুয়ে পড়ো!!🌃🛏️🤟  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						{
    timer: '2:00:00 AM',
    message: ['~এখন রাত ১টা বাজে প্রেম না কইরা যাইয়া ঘুমা বেক্কল!!😾😾  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '3:00:00 AM',
    message: ['~এখন রাত ২টা বাজে যারা ছ্যাকা খাইছে তারা জেগে আছে!!🫠🫠  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '4:00:00 AM',
    message: ['~এখন রাত ৩টা বাজে সবাই মনে হয় ঘুম🥹 আমার ভাই ঘুম আসে না!!😭💔  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '5:00:00 AM',
    message: ['~এখন রাত ৪টা বাজে একটু পর সকাল হবে ঘুম থেকে উঠে পরিও সবাই!!🌅🌄 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '6:00:00 AM',
    message: ['~এখন ভোর ৫টা বাজে সবাই ঘুম থেকে উঠেছ তো?!❤️  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '7:00:00 AM',
    message: ['~এখন সকাল ৬টা বাজে ঘুম থেকে উঠো সবাই এবং হাত মুখ ধুয়ে নাও!!🦷🪥 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '8:00:00 AM',
    message: ['~এখন সকাল ৭টা বাজে সবাই ব্রেকফাস্ট করে নাও!!🥪🥣😊 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '9:00:00 AM',
    message: ['~এখন সকাল ৮ টা বাজে সবাই মনে হয় কাজে ব্যস্ত হয়ে গেছো!!🥲🥲 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
             {
    timer: '10:00:00 AM',
    message: ['~এখন সকাল ৯ টা বাজে মন দিয়ে কাজ করো সবাই!!😘❤️  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['~এখন সকাল ১০টা বাজে মিস করছি তোমাদের!!😌😇  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '12:00:00 PM',
    message: ['~এখন সকাল ১১টা বাজে একটু পর সবাই স্নান করে নিও!!🛀🏻🧖🏻🧼  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},					
						 {
    timer: '1:00:00 PM',
    message: ['~এখন দুপুর ১২টা বাজে একটু পর সবাই দুপুরের খাবার খেয়ে নিও!!🎀❤️ 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '2:00:00 PM',
    message: ['~এখন দুপুর ১টা বাজে সবাই কাজ বন্ধ করে দুপুরের খাবার খেয়ে নাও!!🙂😻 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '3:00:00 PM',
    message: ['~এখন দুপুর ২টা বাজে সবাই একটু বিশ্রাম নাও!!🥰☺️  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '4:00:00 PM',
    message: ['~এখন দুপুর ৩টা বাজে কি করছো সবাই!!😗😘❤️  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						{
    timer: '5:00:00 PM',
    message: ['~ এখন বিকাল ৪টা বাজে কাজে নাকি সবাই!!🥰🥀 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '6:00:00 PM',
    message: ['~এখন বিকাল ৫টা বাজে একটু পর সন্ধ্যা হবে!!❤️😻  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
						 {
    timer: '7:00:00 PM',
    message: ['~এখন সন্ধ্যা ৬টা বাজে সবাই হাতমুখ ধুয়ে কিছু খেয়ে নাও এবং পরিবারের সাথে সময় কাটাও!!!😍 𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
             {
    timer: '8:00:00 PM',
    message: ['এখন সন্ধ্যা ৭ টা বাজে কি করছো সবাই পড়তে না বসে!!😘❤️  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
             {
    timer: '9:00:00 PM',
    message: ['~এখন রাত ৮টা বাজে পড়তে না বসে মোবাইল নিয়ে কি করো!!!📵📵  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
             {
    timer: '10:00:00 PM',
    message: ['এখন রাত ৯টা বাজে সবাই কি শুয়ে পড়লা!!🌃🛏️🙂  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
},
            {
    timer: '11:00:00 PM',
    message: ['~এখন রাত ১০টা বাজে সবাই ঘুমায় পড়ো আমার বউ নাই ভাই ঘুম ও আসে না!!🥲😭  𝐂𝐑𝐄𝐀𝐓𝐎𝐑⇰ 𝐒𝐎𝐔𝐑𝐀𝐕 𝐕𝐀𝐈']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
